---
kind: method
id: M:Autodesk.Revit.DB.View.GetCropRegionShapeManager
zh: 视图
source: html/e2f53728-9b72-227a-f585-9dccf6d79d9f.htm
---
# Autodesk.Revit.DB.View.GetCropRegionShapeManager Method

**中文**: 视图

Returns an object for managing view crop region shape.

## Syntax (C#)
```csharp
public ViewCropRegionShapeManager GetCropRegionShapeManager()
```

## Returns
The crop region shape manager.